yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg328a.h
/* Status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
} __BITS_STMR_SR1;
#endif
__IO_REG8_BIT(STMR_SR1,    0x5342, __READ_WRITE, __BITS_STMR_SR1);

/* Event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
} __BITS_STMR_EGR;
#endif
__IO_REG8_BIT(STMR_EGR,    0x5343, __WRITE, __BITS_STMR_EGR);

/* Counter high register */
__IO_REG8    (STMR_CNTH,   0x5344, __READ_WRITE);
/* Counter low register */
__IO_REG8    (STMR_CNTL,   0x5345, __READ_WRITE);
/* Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_STMR_PSCL;
#endif
__IO_REG8_BIT(STMR_PSCL,   0x5346, __READ_WRITE, __BITS_STMR_PSCL);

/* Auto-reload high register */
__IO_REG8    (STMR_ARRH,   0x5347, __READ_WRITE);
/* Auto-reload low register */
__IO_REG8    (STMR_ARRL,   0x5348, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      STMR Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define STMR_CR1_CEN             STMR_CR1_bit.CEN
#define STMR_CR1_UDIS            STMR_CR1_bit.UDIS
#define STMR_CR1_URS             STMR_CR1_bit.URS
#define STMR_CR1_OPM             STMR_CR1_bit.OPM
#define STMR_CR1_ARPE            STMR_CR1_bit.ARPE

#define STMR_IER_UIE             STMR_IER_bit.UIE

#define STMR_SR1_UIF             STMR_SR1_bit.UIF

#define STMR_EGR_UG              STMR_EGR_bit.UG

#define STMR_PSCL_PSC            STMR_PSCL_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      STMR Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_STMR_CR1_CEN        0x01
#define MASK_STMR_CR1_UDIS       0x02
#define MASK_STMR_CR1_URS        0x04
#define MASK_STMR_CR1_OPM        0x08
#define MASK_STMR_CR1_ARPE       0x80

#define MASK_STMR_IER_UIE        0x01

#define MASK_STMR_SR1_UIF        0x01

#define MASK_STMR_EGR_UG         0x01

#define MASK_STMR_PSCL_PSC       0x07


/*-------------------------------------------------------------------------
 *      DALI Registers register definitions
 *-----------------------------------------------------------------------*/
/* Clock prescaler LSB */
__IO_REG8    (DALI_CLK_L,  0x53C0, __READ_WRITE);
/* Clock prescaler MSB */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DALI_CLK    : 2;
} __BITS_DALI_CLK_H;
#endif
__IO_REG8_BIT(DALI_CLK_H,  0x53C1, __READ_WRITE, __BITS_DALI_CLK_H);

/* Message byte 0 register */
__IO_REG8    (DALI_FB0,    0x53C2, __READ);
/* Message byte 1 register */
__IO_REG8    (DALI_FB1,    0x53C3, __READ);
/* Message byte 2 register */
__IO_REG8    (DALI_FB2,    0x53C4, __READ);
/* Backward Data register */
__IO_REG8    (DALI_BD,     0x53C5, __READ_WRITE);
/* Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FTS         : 1;
  unsigned char RTS         : 1;
  unsigned char RTA         : 1;
  unsigned char DCME        : 1;
  unsigned char MLN         : 2;
  unsigned char SMK         : 1;
  unsigned char LNWDG_EN    : 1;
} __BITS_DALI_CR;
#endif
__IO_REG8_BIT(DALI_CR,     0x53C6, __READ_WRITE, __BITS_DALI_CR);

/* Control and Status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char WDGF        : 1;
  unsigned char WDGE        : 1;
  unsigned char RTF         : 1;
  unsigned char EF          : 1;
  unsigned char ITF         : 1;
  unsigned char IEN         : 1;
} __BITS_DALI_CSR;
#endif
__IO_REG8_BIT(DALI_CSR,    0x53C7, __READ_WRITE, __BITS_DALI_CSR);

/* Control and Status register1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WDG_PRSC    : 3;
  unsigned char RDY_REC     : 1;
  unsigned char CKS         : 4;
} __BITS_DALI_CSR1;
#endif
__IO_REG8_BIT(DALI_CSR1,   0x53C8, __READ_WRITE, __BITS_DALI_CSR1);

/* Control reverse signal line */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN_REV      : 1;
  unsigned char REV_DIN     : 1;
  unsigned char REV_DOUT    : 1;
} __BITS_DALI_REVLN;
#endif
__IO_REG8_BIT(DALI_REVLN,  0x53C9, __READ_WRITE, __BITS_DALI_REVLN);


/*-------------------------------------------------------------------------
 *      DALI Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define DALI_CLK_H_DALI_CLK      DALI_CLK_H_bit.DALI_CLK

#define DALI_CR_FTS              DALI_CR_bit.FTS
#define DALI_CR_RTS              DALI_CR_bit.RTS
#define DALI_CR_RTA              DALI_CR_bit.RTA
#define DALI_CR_DCME             DALI_CR_bit.DCME
#define DALI_CR_MLN              DALI_CR_bit.MLN
#define DALI_CR_SMK              DALI_CR_bit.SMK
#define DALI_CR_LNWDG_EN         DALI_CR_bit.LNWDG_EN

#define DALI_CSR_WDGF            DALI_CSR_bit.WDGF
#define DALI_CSR_WDGE            DALI_CSR_bit.WDGE
#define DALI_CSR_RTF             DALI_CSR_bit.RTF
#define DALI_CSR_EF              DALI_CSR_bit.EF
#define DALI_CSR_ITF             DALI_CSR_bit.ITF
#define DALI_CSR_IEN             DALI_CSR_bit.IEN

#define DALI_CSR1_WDG_PRSC       DALI_CSR1_bit.WDG_PRSC
#define DALI_CSR1_RDY_REC        DALI_CSR1_bit.RDY_REC
#define DALI_CSR1_CKS            DALI_CSR1_bit.CKS

#define DALI_REVLN_EN_REV        DALI_REVLN_bit.EN_REV
#define DALI_REVLN_REV_DIN       DALI_REVLN_bit.REV_DIN
#define DALI_REVLN_REV_DOUT      DALI_REVLN_bit.REV_DOUT

#endif

/*-------------------------------------------------------------------------
 *      DALI Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_DALI_CLK_H_DALI_CLK 0x03

#define MASK_DALI_CR_FTS         0x01
#define MASK_DALI_CR_RTS         0x02
#define MASK_DALI_CR_RTA         0x04
#define MASK_DALI_CR_DCME        0x08
#define MASK_DALI_CR_MLN         0x30
#define MASK_DALI_CR_SMK         0x40
#define MASK_DALI_CR_LNWDG_EN    0x80

#define MASK_DALI_CSR_WDGF       0x04
#define MASK_DALI_CSR_WDGE       0x08
#define MASK_DALI_CSR_RTF        0x10
#define MASK_DALI_CSR_EF         0x20
#define MASK_DALI_CSR_ITF        0x40
#define MASK_DALI_CSR_IEN        0x80

#define MASK_DALI_CSR1_WDG_PRSC  0x07
#define MASK_DALI_CSR1_RDY_REC   0x08
#define MASK_DALI_CSR1_CKS       0xF0

#define MASK_DALI_REVLN_EN_REV   0x01
#define MASK_DALI_REVLN_REV_DIN  0x02
#define MASK_DALI_REVLN_REV_DOUT 0x04


/*-------------------------------------------------------------------------
 *      ADC Registers register definitions
 *-----------------------------------------------------------------------*/
/* Configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PD          : 1;
  unsigned char STOP        : 1;
  unsigned char FIFO_FLUSH  : 1;
  unsigned char CIRCULAR    : 1;
  unsigned char FORMAT      : 1;
} __BITS_ADC_CFG;
#endif
__IO_REG8_BIT(ADC_CFG,     0x5400, __READ_WRITE, __BITS_ADC_CFG);

