yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostnrg328a.h
#define SMD2_PRM_S22_LATCH_RS    SMD2_PRM_S22_bit.LATCH_RS

#define SMD2_PRM_S30_NX_STAT0    SMD2_PRM_S30_bit.NX_STAT0
#define SMD2_PRM_S30_NX_STAT1    SMD2_PRM_S30_bit.NX_STAT1
#define SMD2_PRM_S30_EDGE0       SMD2_PRM_S30_bit.EDGE0
#define SMD2_PRM_S30_EDGE1       SMD2_PRM_S30_bit.EDGE1
#define SMD2_PRM_S30_CNT_RSTE    SMD2_PRM_S30_bit.CNT_RSTE
#define SMD2_PRM_S30_PULS_EDG    SMD2_PRM_S30_bit.PULS_EDG
#define SMD2_PRM_S30_HOLD_JMP    SMD2_PRM_S30_bit.HOLD_JMP
#define SMD2_PRM_S30_AND_OR      SMD2_PRM_S30_bit.AND_OR

#define SMD2_PRM_S31_CEDGE0      SMD2_PRM_S31_bit.CEDGE0
#define SMD2_PRM_S31_CEDGE1      SMD2_PRM_S31_bit.CEDGE1
#define SMD2_PRM_S31_CNT_RSTC    SMD2_PRM_S31_bit.CNT_RSTC
#define SMD2_PRM_S31_PULS_CMP    SMD2_PRM_S31_bit.PULS_CMP
#define SMD2_PRM_S31_HOLD_EXIT   SMD2_PRM_S31_bit.HOLD_EXIT

#define SMD2_PRM_S32_LATCH_RS    SMD2_PRM_S32_bit.LATCH_RS

#define SMD2_CFG_TIM_NUM0        SMD2_CFG_bit.TIM_NUM0
#define SMD2_CFG_TIM_NUM1        SMD2_CFG_bit.TIM_NUM1
#define SMD2_CFG_TIM_UPD0        SMD2_CFG_bit.TIM_UPD0
#define SMD2_CFG_TIM_UPD1        SMD2_CFG_bit.TIM_UPD1

#define SMD2_DMP_L_CNT_LO0       SMD2_DMP_L_bit.CNT_LO0
#define SMD2_DMP_L_CNT_LO1       SMD2_DMP_L_bit.CNT_LO1
#define SMD2_DMP_L_CNT_LO2       SMD2_DMP_L_bit.CNT_LO2
#define SMD2_DMP_L_CNT_LO3       SMD2_DMP_L_bit.CNT_LO3
#define SMD2_DMP_L_CNT_LO4       SMD2_DMP_L_bit.CNT_LO4
#define SMD2_DMP_L_CNT_LO5       SMD2_DMP_L_bit.CNT_LO5
#define SMD2_DMP_L_CNT_LO6       SMD2_DMP_L_bit.CNT_LO6
#define SMD2_DMP_L_CNT_LO7       SMD2_DMP_L_bit.CNT_LO7

#define SMD2_DMP_H_CNT_LH0       SMD2_DMP_H_bit.CNT_LH0
#define SMD2_DMP_H_CNT_LH1       SMD2_DMP_H_bit.CNT_LH1
#define SMD2_DMP_H_CNT_LH2       SMD2_DMP_H_bit.CNT_LH2
#define SMD2_DMP_H_CNT_LH3       SMD2_DMP_H_bit.CNT_LH3
#define SMD2_DMP_H_CNT_LH4       SMD2_DMP_H_bit.CNT_LH4
#define SMD2_DMP_H_CNT_LH5       SMD2_DMP_H_bit.CNT_LH5
#define SMD2_DMP_H_CNT_LH6       SMD2_DMP_H_bit.CNT_LH6
#define SMD2_DMP_H_CNT_LH7       SMD2_DMP_H_bit.CNT_LH7

#define SMD2_GSTS_EX0_DUMP       SMD2_GSTS_bit.EX0_DUMP
#define SMD2_GSTS_EX1_DUMP       SMD2_GSTS_bit.EX1_DUMP
#define SMD2_GSTS_EX2_DUMP       SMD2_GSTS_bit.EX2_DUMP
#define SMD2_GSTS_CNT_FLAG       SMD2_GSTS_bit.CNT_FLAG
#define SMD2_GSTS_DMP_LK0        SMD2_GSTS_bit.DMP_LK0
#define SMD2_GSTS_DMP_LK1        SMD2_GSTS_bit.DMP_LK1
#define SMD2_GSTS_EVENT_OV       SMD2_GSTS_bit.EVENT_OV

#define SMD2_ISR_CNT_OVER        SMD2_ISR_bit.CNT_OVER
#define SMD2_ISR_EXT0_INT        SMD2_ISR_bit.EXT0_INT
#define SMD2_ISR_EXT1_INT        SMD2_ISR_bit.EXT1_INT
#define SMD2_ISR_EXT2_INT        SMD2_ISR_bit.EXT2_INT
#define SMD2_ISR_STA_S0_IT       SMD2_ISR_bit.STA_S0_IT
#define SMD2_ISR_STA_S1_IT       SMD2_ISR_bit.STA_S1_IT
#define SMD2_ISR_STA_S2_IT       SMD2_ISR_bit.STA_S2_IT
#define SMD2_ISR_STA_S3_IT       SMD2_ISR_bit.STA_S3_IT

#define SMD2_IMR_CNT_OV_R        SMD2_IMR_bit.CNT_OV_R
#define SMD2_IMR_IT_EXT0         SMD2_IMR_bit.IT_EXT0
#define SMD2_IMR_IT_EXT1         SMD2_IMR_bit.IT_EXT1
#define SMD2_IMR_IT_EXT2         SMD2_IMR_bit.IT_EXT2
#define SMD2_IMR_IT_STA_S0       SMD2_IMR_bit.IT_STA_S0
#define SMD2_IMR_IT_STA_S1       SMD2_IMR_bit.IT_STA_S1
#define SMD2_IMR_IT_STA_S2       SMD2_IMR_bit.IT_STA_S2
#define SMD2_IMR_IT_STA_S3       SMD2_IMR_bit.IT_STA_S3

#define SMD2_ISEL_INPUT0_EN      SMD2_ISEL_bit.INPUT0_EN
#define SMD2_ISEL_INPUT1_EN      SMD2_ISEL_bit.INPUT1_EN
#define SMD2_ISEL_INPUT2_EN      SMD2_ISEL_bit.INPUT2_EN
#define SMD2_ISEL_INPUT_LAT      SMD2_ISEL_bit.INPUT_LAT

#define SMD2_DMP_DMPE_EX0        SMD2_DMP_bit.DMPE_EX0
#define SMD2_DMP_DMPE_EX1        SMD2_DMP_bit.DMPE_EX1
#define SMD2_DMP_DMPE_EX2        SMD2_DMP_bit.DMPE_EX2
#define SMD2_DMP_DMP_EVER        SMD2_DMP_bit.DMP_EVER
#define SMD2_DMP_CPL_IT_GE       SMD2_DMP_bit.CPL_IT_GE

#define SMD2_FSM_STS_FSM0        SMD2_FSM_STS_bit.FSM0
#define SMD2_FSM_STS_FSM1        SMD2_FSM_STS_bit.FSM1
#define SMD2_FSM_STS_FSM2        SMD2_FSM_STS_bit.FSM2
#define SMD2_FSM_STS_PWM         SMD2_FSM_STS_bit.PWM
#define SMD2_FSM_STS_EVINP0      SMD2_FSM_STS_bit.EVINP0
#define SMD2_FSM_STS_EVINP1      SMD2_FSM_STS_bit.EVINP1
#define SMD2_FSM_STS_EVINP2      SMD2_FSM_STS_bit.EVINP2

#endif

/*-------------------------------------------------------------------------
 *      SMED 2 Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_SMD2_CTR_START_CNT  0x01
#define MASK_SMD2_CTR_FSM_ENA    0x02

#define MASK_SMD2_CTR_TMR_TIME_T0_VAL 0x01
#define MASK_SMD2_CTR_TMR_TIME_T1_VAL 0x02
#define MASK_SMD2_CTR_TMR_TIME_T2_VAL 0x04
#define MASK_SMD2_CTR_TMR_TIME_T3_VAL 0x08
#define MASK_SMD2_CTR_TMR_DITHER_VAL 0x10

#define MASK_SMD2_CTR_INP_RS_INSIG0 0x01
#define MASK_SMD2_CTR_INP_RS_INSIG1 0x02
#define MASK_SMD2_CTR_INP_RS_INSIG2 0x04
#define MASK_SMD2_CTR_INP_RAIS_EN 0x08
#define MASK_SMD2_CTR_INP_EL_INSIG0 0x10
#define MASK_SMD2_CTR_INP_EL_INSIG1 0x20
#define MASK_SMD2_CTR_INP_EL_INSIG2 0x40
#define MASK_SMD2_CTR_INP_EL_EN  0x80

#define MASK_SMD2_CTR_DTHR_DITH0 0x01
#define MASK_SMD2_CTR_DTHR_DITH1 0x02
#define MASK_SMD2_CTR_DTHR_DITH2 0x04
#define MASK_SMD2_CTR_DTHR_DITH3 0x08
#define MASK_SMD2_CTR_DTHR_DITH4 0x10
#define MASK_SMD2_CTR_DTHR_DITH5 0x20
#define MASK_SMD2_CTR_DTHR_DITH6 0x40
#define MASK_SMD2_CTR_DTHR_DITH7 0x80

#define MASK_SMD2_TMR_T0L_TIM_T0L0 0x01
#define MASK_SMD2_TMR_T0L_TIM_T0L1 0x02
#define MASK_SMD2_TMR_T0L_TIM_T0L2 0x04
#define MASK_SMD2_TMR_T0L_TIM_T0L3 0x08
#define MASK_SMD2_TMR_T0L_TIM_T0L4 0x10
#define MASK_SMD2_TMR_T0L_TIM_T0L5 0x20
#define MASK_SMD2_TMR_T0L_TIM_T0L6 0x40
#define MASK_SMD2_TMR_T0L_TIM_T0L7 0x80

#define MASK_SMD2_TMR_T0H_TIM_T0H0 0x01
#define MASK_SMD2_TMR_T0H_TIM_T0H1 0x02
#define MASK_SMD2_TMR_T0H_TIM_T0H2 0x04
#define MASK_SMD2_TMR_T0H_TIM_T0H3 0x08
#define MASK_SMD2_TMR_T0H_TIM_T0H4 0x10
#define MASK_SMD2_TMR_T0H_TIM_T0H5 0x20
#define MASK_SMD2_TMR_T0H_TIM_T0H6 0x40
#define MASK_SMD2_TMR_T0H_TIM_T0H7 0x80

#define MASK_SMD2_TMR_T1L_TIM_T1L0 0x01
#define MASK_SMD2_TMR_T1L_TIM_T1L1 0x02
#define MASK_SMD2_TMR_T1L_TIM_T1L2 0x04
#define MASK_SMD2_TMR_T1L_TIM_T1L3 0x08
#define MASK_SMD2_TMR_T1L_TIM_T1L4 0x10
#define MASK_SMD2_TMR_T1L_TIM_T1L5 0x20
#define MASK_SMD2_TMR_T1L_TIM_T1L6 0x40
#define MASK_SMD2_TMR_T1L_TIM_T1L7 0x80

#define MASK_SMD2_TMR_T1H_TIM_T1H0 0x01
#define MASK_SMD2_TMR_T1H_TIM_T1H1 0x02
#define MASK_SMD2_TMR_T1H_TIM_T1H2 0x04
#define MASK_SMD2_TMR_T1H_TIM_T1H3 0x08
#define MASK_SMD2_TMR_T1H_TIM_T1H4 0x10
#define MASK_SMD2_TMR_T1H_TIM_T1H5 0x20
#define MASK_SMD2_TMR_T1H_TIM_T1H6 0x40
#define MASK_SMD2_TMR_T1H_TIM_T1H7 0x80

#define MASK_SMD2_TMR_T2L_TIM_T2L0 0x01
#define MASK_SMD2_TMR_T2L_TIM_T2L1 0x02
#define MASK_SMD2_TMR_T2L_TIM_T2L2 0x04
#define MASK_SMD2_TMR_T2L_TIM_T2L3 0x08
#define MASK_SMD2_TMR_T2L_TIM_T2L4 0x10
#define MASK_SMD2_TMR_T2L_TIM_T2L5 0x20
#define MASK_SMD2_TMR_T2L_TIM_T2L6 0x40
#define MASK_SMD2_TMR_T2L_TIM_T2L7 0x80

#define MASK_SMD2_TMR_T2H_TIM_T2H0 0x01
#define MASK_SMD2_TMR_T2H_TIM_T2H1 0x02
#define MASK_SMD2_TMR_T2H_TIM_T2H2 0x04
#define MASK_SMD2_TMR_T2H_TIM_T2H3 0x08
#define MASK_SMD2_TMR_T2H_TIM_T2H4 0x10
#define MASK_SMD2_TMR_T2H_TIM_T2H5 0x20
#define MASK_SMD2_TMR_T2H_TIM_T2H6 0x40
#define MASK_SMD2_TMR_T2H_TIM_T2H7 0x80

#define MASK_SMD2_TMR_T3L_TIM_T3L0 0x01
#define MASK_SMD2_TMR_T3L_TIM_T3L1 0x02
#define MASK_SMD2_TMR_T3L_TIM_T3L2 0x04
#define MASK_SMD2_TMR_T3L_TIM_T3L3 0x08
#define MASK_SMD2_TMR_T3L_TIM_T3L4 0x10
#define MASK_SMD2_TMR_T3L_TIM_T3L5 0x20
#define MASK_SMD2_TMR_T3L_TIM_T3L6 0x40
#define MASK_SMD2_TMR_T3L_TIM_T3L7 0x80

#define MASK_SMD2_TMR_T3H_TIM_T3H0 0x01
#define MASK_SMD2_TMR_T3H_TIM_T3H1 0x02
#define MASK_SMD2_TMR_T3H_TIM_T3H2 0x04
#define MASK_SMD2_TMR_T3H_TIM_T3H3 0x08
#define MASK_SMD2_TMR_T3H_TIM_T3H4 0x10
#define MASK_SMD2_TMR_T3H_TIM_T3H5 0x20
#define MASK_SMD2_TMR_T3H_TIM_T3H6 0x40
#define MASK_SMD2_TMR_T3H_TIM_T3H7 0x80

#define MASK_SMD2_PRM_ID0_NX_STAT0 0x01
#define MASK_SMD2_PRM_ID0_NX_STAT1 0x02
#define MASK_SMD2_PRM_ID0_EDGE0  0x04
#define MASK_SMD2_PRM_ID0_EDGE1  0x08
#define MASK_SMD2_PRM_ID0_CNT_RSTE 0x10
#define MASK_SMD2_PRM_ID0_PULS_EDG 0x20
#define MASK_SMD2_PRM_ID0_HOLD_JMP 0x40
#define MASK_SMD2_PRM_ID0_AND_OR 0x80

